src/Reports/ОтчетПоПроизводственнымЗаданиямПоСчёту/ОтчетПоПроизводственнымЗаданиямПоСчёту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизводственнымЗаданиямПоСчёту</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыРемонта/СтатусыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонта</name>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Окончен</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоПроизводственнымЗаданиямПоСчёту/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьСписокРМ(Линейка) 
Запрос = Новый Запрос;

СписокРМ.Очистить();
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРМ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаСтенд = Макет.ПолучитьОбласть("Шапка|Стенд");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");
	
ОблМТКОбщие = Макет.ПолучитьОбласть("МТК|Общие");	
ОблМТКРабочееМесто = Макет.ПолучитьОбласть("МТК|РабочееМесто");
ОблМТКСтенд = Макет.ПолучитьОбласть("МТК|Стенд");
ОблМТКРемонт = Макет.ПолучитьОбласть("МТК|Ремонт");

ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗСтенд = Макет.ПолучитьОбласть("ПЗ|Стенд");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецСтенд = Макет.ПолучитьОбласть("Конец|Стенд");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблЗаголовок.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ОблЗаголовок.Параметры.Счёт = СокрЛП(Счёт);
ТабДок.Вывести(ОблЗаголовок);

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка,
	|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
	|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
	|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
	|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование,
	|	ПроизводственноеЗадание.ДокументОснование.Линейка КАК Линейка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПроизводственноеЗадание.ДокументОснование.Счёт = &Счёт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроизводственноеЗадание.ДокументОснование.Линейка,
	|	НомерМТК,
	|	ПроизводственноеЗадание.Номер
	|ИТОГИ ПО
	|	Линейка";
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));	
Запрос.УстановитьПараметр("Счёт",Счёт); 
Результат = Запрос.Выполнить();
ВыборкаЛинейки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейки.Следующий() Цикл
	ПолучитьСписокРМ(ВыборкаЛинейки.Линейка);
	ОблШапкаОбщие.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ОблШапкаОбщие.Параметры.ЛинейкаКомм = ВыборкаЛинейки.Линейка.Комментарий;
	ТабДок.Вывести(ОблШапкаОбщие);
		Для каждого РМ Из СписокРМ Цикл
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ОблШапкаСтенд.Параметры.РабочееМесто = РМ.Значение;
			ТабДок.Присоединить(ОблШапкаСтенд);
			Иначе
			ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
			ТабДок.Присоединить(ОблШапкаРабочееМесто);
			КонецЕсли; 
		КонецЦикла;
	ТабДок.Присоединить(ОблШапкаРемонт);
	НомСтр = 0;
	ТекМТК = Документы.МаршрутнаяКарта.ПустаяСсылка();
	ВыборкаДетальныеЗаписи = ВыборкаЛинейки.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТекМТК <> ВыборкаДетальныеЗаписи.МТК Тогда
			ТекМТК = ВыборкаДетальныеЗаписи.МТК;
			ОблМТКОбщие.Параметры.МТК = ВыборкаДетальныеЗаписи.МТК;
			ОблМТКОбщие.Параметры.НомерМТК = ВыборкаДетальныеЗаписи.МТК.Номер;
			ОблМТКОбщие.Параметры.ОсобаяОтметка = ВыборкаДетальныеЗаписи.МТК.СтандартныйКомментарий.ОсобаяОтметка;
				Если Не ВыборкаДетальныеЗаписи.Товар.Пустая() Тогда
				ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.Товар.Наименование);
				Иначе
				ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.МТК.Номенклатура.Наименование);
				КонецЕсли; 
					Если ВыборкаДетальныеЗаписи.МТК.Статус = 2 Тогда
					ОблМТКОбщие.Параметры.Остановка = "О";
					Иначе
					ОблМТКОбщие.Параметры.Остановка = "";
					КонецЕсли; 
			ТабДок.Вывести(ОблМТКОбщие);
				Для каждого РМ Из СписокРМ Цикл
					Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
					ТабДок.Присоединить(ОблМТКСтенд);
					Иначе
					ТабДок.Присоединить(ОблМТКРабочееМесто);
					КонецЕсли;
				КонецЦикла;
			ТабДок.Присоединить(ОблМТКРемонт);
			КонецЕсли; 
		НомСтр = НомСтр + 1;
		ОблПЗОбщие.Параметры.НомСтр = НомСтр;
		СтатусРемонта = Перечисления.СтатусыРемонта.ПустаяСсылка();
		ПЗ = ВыборкаДетальныеЗаписи.Ссылка;				
	    ОблПЗОбщие.Параметры.ПЗ = ПЗ;
		ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
		ОблПЗОбщие.Параметры.ВозвратнаяТара = СокрЛП(ПЗ.ВозвратнаяТара);
		ОблПЗОбщие.Параметры.БарКод = ПЗ.БарКод;
		ОблПЗОбщие.Параметры.ДатаОтгрузки = Формат(ПЗ.ДокументОснование.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
		ВыборкаЛО.Сбросить();
		СтуктураПоиска = Новый Структура("ПЗ",ПЗ);
			Если ВыборкаЛО.НайтиСледующий(СтуктураПоиска) Тогда
			ЛО = "ЛО";
			Иначе
			ЛО = "";
			КонецЕсли; 
		ОблПЗОбщие.Параметры.ЛО = ЛО;
		ТабДок.Вывести(ОблПЗОбщие);
		Отбор = Новый Структура("ПЗ",ПЗ);
			Для каждого РМ Из СписокРМ Цикл	
			ДатаНачала = "";
			ДатаОкончания = "";
				Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
				ТекПЗ = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Отбор);			
				ОблПЗСтенд.Параметры.ДатаНачала = ТекПЗ.ДатаПостановки;
				ОблПЗСтенд.Параметры.ДатаОкончания = ТекПЗ.ДатаСнятия;
				ОблПЗСтенд.Параметры.Прогон = ТекПЗ.Прогон;
				ТабДок.Присоединить(ОблПЗСтенд);
				Иначе
				ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
					Пока ТекПЗ.Следующий() Цикл
						Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
						ДатаНачала = ТекПЗ.ДатаНачала;
						ДатаОкончания = ТекПЗ.ДатаОкончания;
						Прервать;
						КонецЕсли; 
					КонецЦикла;
				ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
				ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
				ТабДок.Присоединить(ОблПЗРабочееМесто);
				КонецЕсли;			
			КонецЦикла;
		ЗапросРемонт = Новый Запрос;

		ЗапросРемонт.Текст = 
			"ВЫБРАТЬ
			|	РемонтнаяКарта.Ссылка
			|ИЗ
			|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
			|ГДЕ
			|	РемонтнаяКарта.ДокументОснование = &ДокументОснование
			|	И РемонтнаяКарта.Проведен = ЛОЖЬ";			
		ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
		РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
		ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
			Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
			СтатусРемонта = Перечисления.СтатусыРемонта.Ремонт;
			КонецЦикла;
		ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
		ОблПЗРемонт.Параметры.ПЗ = ПЗ;
		ТабДок.Присоединить(ОблПЗРемонт);			
		КонецЦикла;
	ТабДок.Вывести(ОблКонецОбщие);
		Для каждого РМ Из СписокРМ Цикл
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ТабДок.Присоединить(ОблКонецСтенд);
			Иначе
			ТабДок.Присоединить(ОблКонецРабочееМесто);
			КонецЕсли;
		КонецЦикла;
	ТабДок.Присоединить(ОблКонецРемонт);
	КонецЦикла;			
ТабДок.ФиксацияСверху = 1;
ТабДок.ФиксацияСлева = 6;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
//ИмяКолонки = СокрЛП(Сред(Элемент.ТекущаяОбласть.Имя,Найти(Элемент.ТекущаяОбласть.Имя,"C")));
//	Если ИмяКолонки <> "C2" Тогда
//	СтандартнаяОбработка = Ложь;
//	П = Новый Структура("ПЗ",Расшифровка);
//	ОткрытьФорму("Отчет.ОтчетПоРемонту.Форма.ФормаОтчета",П);
//	КонецЕсли; 
КонецПроцедуры
